package by.htp.tasksolution.task01;

public class Point {
	int x;
	int y;

	Point(int x, int y) {
		this.x = x;
		this.y = y;
	}

	int getX() {
		return x;
	}

	int getY() {
		return y;
	}

}
//1. Cоздать матрицу 3 x 4, заполнить ее числами 0 и 1 так, чтобы в одной строке была ровно одна единица, и вывести на экран. 

2. Создать и вывести на экран матрицу 2 x 3, заполненную случайными числами из [0, 9]. 

3. Дана матрица. Вывести на экран первый и последний столбцы. 

4. Дана матрица. Вывести на экран первую и последнюю строки. 